package com.mysliukserhii.p1112.ui.general

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class GeneralViewModel : ViewModel() {

    private val _text = MutableLiveData<String>().apply {
        value ="•Зберігайте спокій, уникайте паніки.\n" +
                "•Дійте негайно, як тільки відчуєте коливання ґрунту або споруди, головна небезпека, яка вам загрожує – це предмети і уламки, що падають.\n" +
                "•Швидко залиште будинок та відійдіть від нього на відкрите місце, якщо ви знаходитесь на першому-другому поверсі.\n" +
                "•Негайно залиште кутові кімнати, якщо ви знаходитесь вище другого поверху.\n" +
                "•Негайно перейдіть у більш безпечне місце, якщо ви знаходитесь у приміщенні. Станьте в отворі внутрішніх дверей або у кутку кімнати, подалі від вікон і важких предметів.\n" +
                "•Не кидайтесь до сходів або до ліфта, якщо ви знаходитесь у висотній споруді вище п'ятого поверху. Вихід зі споруди найбільш буде заповнений людьми, а ліфти вийдуть із ладу.\n" +
                "•Вибігайте з будинку швидко, але обережно. Остерігайтесь уламків, електричних дротів та інших джерел небезпеки.\n" +
                "•Віддаліться від високих споруд, шляхопроводів, мостів та ліній електропередач.\n" +
                "•Зупиніться, якщо ви їдете автомобілем, відчиніть двері та залишайтесь у автомобілі до припинення коливань.\n" +
                "•Перевірте, чи немає поблизу постраждалих, сповістіть про них рятувальників та, по можливості, надайте допомогу"
    }
    val text: LiveData<String> = _text
}